#ifndef _DEFINEDLL_TR20051_
#define	_DEFINEDLL_TR20051_
/**************************************************************/
/* 04. 프로그램기능    : {주식 평가}       	   */
/**************************************************************/

#define		tr_13148MAX				500
#define		SH_KSIZE				6

#define		TR_STOCKEVAL			"20051"
#define		TR_20051				"20051"


/*-----------------------------------------------------------*/
/* Map에서 올라온 Input Data 정의                            */
/*-----------------------------------------------------------*/
typedef struct
{
	char	geja	[20];       /* 계좌번호             	*/
	char    passwd	[ 8];       /* 비밀번호             	*/
    char 	ipaddr  [16];   	/* client ipaddr(199.99.9.90->199099009090)   */
} TR_20051_I;                   

/*-----------------------------------------------------------*/
/* Map으로 보낼 Output Data 정의                             */
/*-----------------------------------------------------------*/
typedef struct
{
    char    geja      [20];    /* 계좌번호                      */
	char    dpsast    [15];    /* 예탁자산총액                  */
	char	d2		  [15];    /* D+2예수금   S9(15)          */
	char    mgnrat    [15];    /* 증거금률100퍼센트주문가능금액 */ 
} TR_20051_O;

#endif