/**************************************************************/
/*  프로그램기능    : {주식 주문 }       					  */
/**************************************************************/

#ifndef _DEFINEDLL_TR20020_
#define	_DEFINEDLL_TR20020_

/*-----------------------------------------------------------*/
/* 주식 주문				                             */
/*-----------------------------------------------------------*/
typedef struct _TR20020_IS
{
	char	clikey     [ 8];   /* 주문 key								     */
	char	gb         [ 1];   /* 1:매도, 2:매수, 3:정정, 4:취소		     */
	char    geja       [20];   /* 계좌번호								     */
	char    passwd     [ 8];   /* 비밀번호								     */
	char    code       [15];   /* 종목코드								     */
	char    wonno      [ 9];   /* 원주문번호							     */
	char    jutype     [ 2];   /* 호가유형코드							     */
							   /* 00:지정,03:시장,05:조건부,06:최유리	     */
	char    juprc      [12];   /* 주문가격 S9(9).99					         */
	char    qty        [15];   /* 주문수량 S9(15)						     */
	char    zMgntrnCode[ 3];   /* 신용거래코드                               */
	                           /* 000:보통 001:유통융자신규 003:자기융자신규 */
	                           /* 007:자기대주신규 101:유통융자상환          */
	                           /* 103:자기융자상환 107:자기대주상환          */
	                           /* 180:예탁담보대출상환(신용)                 */
	char    zLoanDt    [ 8];   /* 대출일자                                   */
	char    ip         [16];   /* 클라이언트 IP주소(예: 192009101031)        */
} TR_20020_IS;

#define SZ_STOCK_IS     sizeof(TR_20020_IS)

#endif